export default {
    welcome: 'Добро Пожаловать',

    // Error
    back_home: 'Повернутися на домашню сторінку',
    error404: 'Помилка 404',

    // AppNavigation
    menu: 'меню',
    profile: 'профайл',
    logout: 'вихід',
    signIn: 'вхід',
    join: 'реєстрація',

    // HomeScreen
    printing: 'друкувати',
    tooltipOrder:
        'Будь ласка, перейдіть на сторінку друку для розміщення замовлення',
    searchModel: 'Пошук 3D моделі...',
    searchModelList: 'Шукайте своїх улюблені',
    models: 'Моделі',
    categories: 'Категорії',
    tooltipCategories: 'Будь ласка виберіть категорію',

    // Card Steps
    painting: 'фарбування',
    modeling: 'Моделювання',
    step: 'крок',
    select_model: 'вибрати модель',
    order_model: 'замовити модель',
    print_model: 'надрукувати модель',
    paint_model: 'розписати модель',

    // Paint Massage
    down_massage: 'Ми доставимо ваше замовлення вчасно в будь-яку точку світу',

    // Footer
    footer_massage: 'Более 100 000 моделей без ліцензійних платежів',
    contact: 'Контакт',
    send: 'відправити',
    name: "Ім'я*",
    email: 'Електронна пошта*',
    subject: 'Тема*',
    message: 'Повідомлення*',
    name_is_required: "Потрібно вказати ім'я",
    name_must_be_greater_than_3_characters: 'Ім’я має бути більше 3 символів',
    ame_must_be_less_than_20_characters:
        "Ім'я повинно бути не менше 20 символів",
    email_is_required: 'Потрібна електронна пошта',
    email_must_be_valid: 'Електронна пошта має бути дійсною',
    subject_is_required: "Тема обов'язкова",
    message_is_required: 'Повідомлення потрібно',
    message_must_be_greater_than_5_characters:
        'Повідомлення має бути більше 5 символів',

    // Modeling
    link_modeling_order:
        'Посилання на Google Папку з матеріалами для створення 3D моделі*',
    sent_modeling_order:
        'Перейдіть на вашу Електронну пошту для підтвердження замовлення',
    error_sent_modeling_order:
        'Сталася неочікувана помилка при відправці замовлення, будь ласка надсилайте ваші замовлення поштою 3dmriya@gmail.com',
    texturing_and_rendering: 'Текстурування і візуалізація',
    close: 'Закрити',
    link_is_required: 'Потрібне посилання',
    link_must_be_valid: 'Посилання має бути дійсним',
    link_must_be_less_than_500_characters:
        'Посилання має бути менше 500 символів',
    desc_google_folder:
        'Це поле для посилання на папку з вашими матеріалами.\n' +
        'Створіть папку на Google Disk і завантажте в неї матеріали (опис, креслення, фотографії, текстури ...) папка повинна мати відкритий доступ для перегляду',
    rendering_info:
        'Для 3D друку вироби необхідна тільки полигональная модель. Текстуровані і візуалізація можуть бути додатково замовлені для подальшого коректного замовлення розпису надрукованого вироби, але тягнуть за собою додаткові фінансові витрати.',
    confirm_order:
        "Ваше замовлення успішно підтверджений. Найближчим часом наші фахівці зв'яжуться з Вами.",
    error_confirm_order:
        'Виникла помилка при підтвердженні замовлення. Для вирішення проблеми відправте нам повідомлення (із зазначенням номера замовлення) на email: ',

    // 3D Printing
    link_printing_order: 'Ссылка на STL 3D модель завантажена на Google Disk*',
    desc_google_stl:
        'Завантажити 3D модель в форматі *.stl на Google Disk. Відкрийте доступ до посилань, а також завантажте посилання у це поле',
    hollow: 'Пустотелость',
    size: 'Коллекційний розмір',
    measure_miniature:
        'Военные колекційні мініатюри змінюються від основ стоп до макушки голови',
    height: 'Висота (в міліметрах)',
    over_height:
        'Вкажіть висоту (в міліметрах) від нижньої до вірніше точки мініатюри. Висота повинна бути не менше 25 міліметрів і не більше 185 міліметрів',
    height_is_required: 'Укажіть висоту',
    height_must_be_numeric: 'Висота повинна бути вказана в цифрах',
    height_must_be_more_25_millimeters:
        'Висота повинна бути не менше 25 міліметрів',
    height_must_be_less_185_millimeters:
        'Висота повинна бути не більше 185 міліметрів',
    height_must_be_less_than_4_numbers: 'Висота повинна бути менше 4 цифри',
    hollow_info:
        'Для удешивления, надрукована модель може бути пустотелой, при певних технічних параметрах цей фактор не впливає на прочність надрукованого виробу.',
    supports: 'Підтримки',
    supports_info:
        'Для коректного 3D друку дуже важливо правильно встановлені підтримки. Якщо ваша * .stl модель вже має підтримки вам не потрібно актевіровать цей чекбокс',
    post_processing: 'Постобработка',
    post_processing_info:
        "Після завершення 3D друку необхідно коректно видалити підтримки і відполірувати місця їх з'єднань. Якщо ви бажаєте зробити це самостійно то вам не потрібно актевіровать цей чекбокс",
    material: 'Матеріал',
    material_info: 'Виберіть матеріал для друку вашого виробу',
    plastic: 'Пластик',
    metal: 'Метал',
    quality: 'Якість',
    quality_info:
        'Виберіть товщину шару друку. Чим тонше шар тим вище якість надрукованого вироби, але тим вище ціна готового виробу',
    micron: 'мікрон',
    size_is_required: 'потрібно вибрати розмір',
    material_is_required: 'потрібно вибрати матеріал',
    quality_is_required: 'потрібно визначити якість',
    quantity_is_required: 'потрібно кількість',
    quantity_must_be_numeric: 'кількість повинна бути числом',
    quantity_must_be_less_than_6_numbers: 'кількість повинна бути менше 6 цифр',
    quantity: 'Кількість (в штуках)',
    other: 'Другий',
    order_3dPrinting: 'замовити 3D Друк',
    recipient_address_title: 'Введіть адресу одержувача',
    country: 'Країна / місце',
    country_is_required: 'Виберіть країну',
    zip: 'Поштовий індекс',
    zip_is_required: "Поштовий індекс обов'язковий",
    range: 'Діапазон та формат індексу:',
    not_determined: 'не визначений',
    state: "Штат (Об'ласть)",
    city: 'Місто (район / населений пункт)',
    city_is_required: "Населений пункт обов'язковий",
    city_must_be_word: 'Населений пункт повинен бути словом',
    city_must_be_greater_than_1_characters:
        'Назва населеного пункту повинно бути не меньше 1 літери',
    city_must_be_less_than_90_characters:
        'Назва населеного пункту повинно бути не більше 90 букв',
    address: 'Адреса (вулиця, будинок, кв)',
    address_is_required: "Адреса обов'язкова",
    phone: 'Номер телефону',
    phone_is_required: "Телефон обов'язковий",
    phone_number_must_be_digital:
        'телефонний номер повинен містити тільки цифри',
    phone_number_must_be_10_digits: 'телефонний номер повинен бути 10 цифр',

    financial: 'Фінансові',
    technical: 'Технічні',
    delivery: 'Доставка',
    investments: 'Інвестиції',
    mass_media: 'Засоби масової інформації',
    legal: 'Юридичні'
};
